Tekla Open API Reference for Tekla Structures 2025
MeshSelectionForm Constructor (List<MeshItem>, String, String)
 Creates a new instance of the MeshSelectionForm and will select in the tree the mesh that contains the given parameters (if possible).
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public MeshSelectionForm(
	List<MeshItem> MeshList,
	string StartingMesh,
	string StartingGrade
)
Public Sub New (
	MeshList As List(Of MeshItem),
	StartingMesh As String,
	StartingGrade As String
)
Parameters
MeshList
Type: System.Collections.Generic.List<MeshItem>
A list with the meshes that will be added to the tree.
StartingMesh
Type: System.String
The name of the mesh to be selected.
StartingGrade
Type: System.String
The grade of the mesh to be selected.
See Also
Reference
MeshSelectionForm Class
MeshSelectionForm Overload
Tekla.Structures.Dialog.UIControls Namespace